Revit 2027 API
BuiltInFailures.StairRampFailures.CannotCreateStairForLevelOverlapping Property
 Some of the multistory stairs couldn't be created due to the overlapped levels.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateStairForLevelOverlapping { get; }
Public Shared ReadOnly Property CannotCreateStairForLevelOverlapping As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateStairForLevelOverlapping {
	FailureDefinitionId^ get ();
}
static member CannotCreateStairForLevelOverlapping : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace